Revit 2027 API
MEPSystem.Elements Property
Terminal elements in the system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementSet Elements { get; }
Public ReadOnly Property Elements As ElementSet
	Get
public:
property ElementSet^ Elements {
	ElementSet^ get ();
}
member Elements : ElementSet with get
Property Value
ElementSet
Remarks
The return value is a read only collection and doesn't include the base equipment or panel.
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace